--lesson
insert  into lesson(Name,join_time) 
values ('英语（二）','2013-01-01 00:00:00'),
('计算机文化基础','2013-01-01 00:00:00'),
('计算机专业英语','2013-01-01 00:00:00'),
('电子商务','2013-01-01 00:00:00'),
('数学','2013-01-01 00:00:00');

--manager
insert  into manager(name,PWD) 
values ('java','1234');

--question
insert  into question(subject,type,join_time,paper_id,
optionA,optionB,optionC,optionD,answer) 
values 
('Windows 2000是什么？','S','2013-01-01 00:00:00',1,
'应用软件','操作系统','应用程序','以上都不是','B')
('网络营销的发展经历几个阶段？','s','2013-01-01 00:00:00',2,
'2个','3个','5个','6个','C'),
('Internet提供的基本服务有哪些？','m','2013-01-01 00:00:00',3,
'E-mail','FTP','Telnet','WWW','A,B,C,D'),
('EPROM代表什么？','s','2013-01-01 00:00:00',4,
'可编程存储器','可擦可编程存储器','只读存储器','可擦可编程只读存储器','D'),
('对于WWW的正确解释有哪些？','m','2013-01-01 00:00:00',1,
'全球网','万维网','局域网','World Wide Web的缩写','A,B,D'),
('5*5','s','2013-01-01 00:00:00',2,
'20','30','25','50','C'),
('下列数据属于整数的是？','m','2013-01-01 00:00:00',3,
'1','2','3','4','A,B,C,D');

--paper
insert  into paper(Name,lesson_id,join_time) 
values ('2007年期末考试',1,'2013-01-01 00:00:00'),
('2007年上半年期中考试题',2,'2013-01-01 00:00:00'),
('2007年期末考试题A',3,'2013-01-01 00:00:00'),
('2008年期末考试题',4,'2013-01-01 00:00:00');  

--student
insert into student(id,name,pwd,sex,join_time,
question,answer,profession,cardNo) 
values 
('CN20071201000001','王晶','111','女','2013-01-01 00:00:00',
'birthday','717','广告学','220198302********'),
('CN20071201000002','无语','111','女','2013-01-01 00:00:00',
'birthday','1','计算机应用软件','220198007********'),
('CN20071201000003','无语','111111','女','2013-01-01 00:00:00',
'我最喜欢的颜色','蓝灰色','计算机应用软件','220104************'),
('CN20071201000004','明明','000','女','2013-01-01 00:00:00',
'你好','你好','公司管理','20020'),
('CN20071201000005','丽丽','111111','女','2013-01-01 00:00:00',
'你好','你好','编程','52200');

--stu_result
insert into stu_result(stu_id,paper_id,res_single,
res_more,res_total,join_time) 
values
('CN20071201000003','4',0,0,0,'2013-01-01 00:00:00'),
('CN20071201000004','1',40,60,100,'2013-01-01 00:00:00'),
('CN20071201000005','2',0,0,0,'2013-01-01 00:00:00');
